# ruby
brew "rbenv"
brew "ruby-build"

# python
brew "pyenv"

# terminal
cask "iterm2"
cask "ghostty"
brew "tmux"
brew "reattach-to-user-namespace" # tmux clipboard integration with y (yank)
brew "direnv"
brew "vim"
brew "the_silver_searcher"
brew "universal-ctags"
brew "gh"

# development
brew "shfmt"
brew "shellcheck"
cask "docker-desktop"
cask "antigravity" # if this fails, try: brew install --cask antigravity --force --no-binaries
cask "postman"
cask "ngrok"
cask "linear-linear"
cask "font-jetbrains-mono"

# other
cask "google-drive" # required for symlinked dotfiles
cask "google-chrome"
cask "1password" # required for ssh key management
brew "mas" # mac app store CLI
brew "duti" # file association
cask "slack"
