tap "1password/tap" # for 1password-cli

# ruby
brew "rbenv"
brew "ruby-build"

# python
brew "pyenv"

# terminal
cask "iterm2"
brew "tmux"
brew "direnv"
brew "vim"
brew "the_silver_searcher"
brew "universal-ctags"

# development
cask "antigravity" # if this fails, try: brew install --cask antigravity --force --no-binaries
cask "docker-desktop"
cask "postman"
cask "ngrok"
cask "1password"
cask "1password-cli"
cask "google-drive"
